report_tracking/app/views/profiles/index.html.erb

                                    <div class="col-auto">
                                       <div class="h5 mb-0 mr-3 font-weight-bold text-gray-800"><%= Report.count %></div>
---
SELECT COUNT(*) FROM "reports"