report_tracking/app/views/home/index.html.erb

SELECT "users"."id" FROM "users"
SELECT COUNT(*) FROM "users"
---
                    Müşteri Sayısı</div>
                  <div class="h5 mb-0 font-weight-bold text-gray-800"><%= User.member.count %></div>

SELECT COUNT(*) FROM "reports"
---
                    <div class="col-auto">
                      <div class="h5 mb-0 mr-3 font-weight-bold text-gray-800"><%= Report.count %></div>