report_tracking/app/controllers/reports_controller.rb

  def create
    @report = Report.new(report_params)

    respond_to do |format|
      if @report.save
---
INSERT INTO "reports" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["description", "testt"], ["created_at", "2023-01-17 12:18:43.364260"], ["updated_at", "2023-01-17 12:18:43.364260"], ["user_id", nil]]

  def update
    respond_to do |format|
      if @report.update(report_params)
---
UPDATE "reports" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "reports"."id" = $4  [["title", "asd"], ["description", "asdd"], ["updated_at", "2023-01-10 11:51:07.760897"], ["id", 1]]

  def destroy
    @report.destroy
---
DELETE FROM "reports" WHERE "reports"."id" = $1  [["id", 1]]

    def set_report
      @report = Report.find(params[:id])
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]